html/posts/setup-lan-network-to-internet-by-hand.html
<!DOCTYPE html>
<html>
<head>
<!-- 2021-01-01 Fri 14:19 -->
<meta charset="utf-8">
<title>Set up a computer run linux OS go to Internet on LAN cable by hand</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Quan Vu">
<meta name="twitter:site" content="@null" />
<meta name="twitter:creator" content="@null" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<link rel="icon" type="image/png" href="https://vhquan.github.io/.images/icon/favicon-32x32.png" />
<link rel="apple-touch-icon-precomposed" href="https://vhquan.github.io/.images/icon/apple-touch-icon.png" />
<link rel="stylesheet" type="text/css" href="https://vhquan.github.io/.css/font.css">
<link rel="stylesheet" type="text/css" href="https://vhquan.github.io/.css/main.css">
</head>
<body>
<div id="wrapper">
<div id="preamble" class="status">
<h1 class="title"><a href="https://vhquan.github.io">Quan Vu's Blog</a></h1>

<nav>
  <div class="navitem"><a href="https://vhquan.github.io">About</a></div>
  <!-- <div class="navitem"><a href="https://vhquan.github.io/html/posts/index.html">Blog</a></div> -->
  <div class="navitem"><A href="https://vhquan.github.io/archive/">Blog</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/portfolio/portfolio.html">Portfolio</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/contact/contact.html">Contact</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/resume/resume.html">R&eacute;sum&eacute;</a></div>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Set up a computer run linux OS go to Internet on LAN cable by hand</h1>
</header><p>
Check status of hardware adapter network is what? <code>ip link show</code>
</p>
<div class="more">

</div>
<p>
Then check ip of machine by using <code>ifconfig</code>
</p>

<p>
To <code>UP</code> adapter network, using <code>ifconfig interface-name up</code>, check again <code>ip link show</code>. Then you have to allocate an IP address, &#x2026;v for the computer &#x2014;&gt; <code>dhclient interface-name</code>.
</p>

<p>
Check internet connection &#x2014;&gt; <code>ping www.google.com</code> or <code>ping 8.8.8.8</code>
</p>

<p>
Hehe.
</p>
</div>
<div id="postamble" class="status">
<div id="footer">
<p>Proudly with <a href="https://www.gnu.org/software/emacs/">Emacs</a> and <a href="https://orgmode.org/">Org Mode</a>.</div>
</div>
</div>
</body>
</html>
